*** Dynamic Scope
The other important strategy of scoping is dynamic scope.  Its main
characteristic, which makes it different from lexical scope is the way
the names for the entities are searched.  When a dynamically scoped
name needs to be resolved, the search starts from the block of code
where the name occurs.  At this point it is not different from lexical
scope.  And if code is written carefully enough in many cases it's
possible to write portable code between lexically and dynamically
scoped versions of the same language.

The difference with the lexical scope starts when the name is not
found in current block.  Whereas lexical scope searches outside, in
the lexical environment, dynamic scope looks in the most recently
defined names, which are in scope.

Another important difference is that the scope ends with the block
that defined the variable or has given a value to the variable.  That
means, that a value is valid as long as the block has not finished
executing.  The functions called have the right to replace the value
with their own value temporarily, as long as they execute.  And as
soon as the block finishes executing, the value of the variable is
lost and the previous value, if it exists, is restored.

One interesting property of dynamic scope is that a name reference can
refer to variables that are lexically defined in different places.
The function called cannot know which variables it references.  It
depends on the execution state of the program.

Dynamic scope has a big disadvantage.  The code that relies heavily on
it is difficult to read, to modify, and to refactor.  The reason is
that when dynamically scoped variables are referenced, several
portions of code become interdependent and if one wants to isolate
some code into a module or a function, there is no way to know which
other functions use these variables.

And also, there is no referential transparency, which makes it
difficult to subdivide the code in pieces and to reason about each
part locally.  As the result, the code can become unmaintainable.

In the past, much more languages were using dynamic scope than now.
The first Lisp, for example, used dynamic scope.  It's after the first
implementations that it became apparent that the behavior of the
dynamic scope is not something that was expected while reading the
source code.  Moreover, lambda calculus, which had a lot of influence
on Lisp used lexical scoping: variables could be bound with variables
outside the current function.

So here is an example that compares lexical and dynamic scopes:
#+BEGIN_SRC elisp
(declare a 1)
(defun fn (b)
  (list a b))
(let ((a 2))
  (fn 3))
#+END_SRC

#+RESULTS:
| 2 | 3 |

This code evaluates to ~(2 3)~.  As you can see, when ~fn~ is called
the ~a~ "parameter" is set to $2$ and overwrites the $1$ value.

Let's look at a similar example in Scheme:

#+BEGIN_SRC scheme
(define a 1)
(define (fn b)
  (list a b))
(let ((a 2))
  (fn 3))
#+END_SRC

#+RESULTS:
| 1 | 3 |

The result of evaluation of this code is ~(1 3)~: we use the first ~a~
that is captured by ~fn~.  The other ~a~, which is in let, is a local
variable and seen from lexical point of view has no relation to the
function.

So why can dynamic scope cause a problem?  In the first example we
have no idea what ~a~ is.  It can really be anything: a number, a
function, a pair...  This is why it is so hard to refactor dynamically
scoped code: we need to inspect and test every instance where ~a~
appears, and only then we can decide what we can do with the function
~fn~.

Dynamic scope makes it also impossible to use closures: when the name
of the variable is looked up, its enclosing blocks are simply ignored.
As for higher-order functions, there are also similar problems.

On the other hand, while not very suited for big projects and despite
difficulties of refactoring, dynamic scope has its place for some
special uses.  For example, it's useful for temporarily setting some
global parameters that one or several functions should access.  When
the current block ends, all the bindings are undone, but before that
these parameters were accessible by the functions called.  One example
of such use is when you have to write into a file with a specific
format of date, but once you have finished writing, you don't need
this format anymore.  But as long as the function that writes to the
file is alive, all the functions that need to write a date, under the
dynamic scope of that function, will know which format to use.

Another important use of dynamic scope is backtracking.  When testing
different possibilities, some settings can be set and the outcome can
be tested.  On failure, other setting can be set and the function that
calculates the outcome can be called once again, and so on.

Dynamic scope is often used for exception handling.  Indeed, the
handlers defined in the block of the code are in many languages
dynamically scoped.  These handlers are typically defined as blocks of
code, often called ~catch~ blocks.  In Java, for example, there is a
~try~ block, which contains calls that might throw exceptions and
there are ~catch~ blocks that describe steps that need to be done when
an exception occurs.  The code inside the catch blocks is called the
exception handler and can be viewed as a function that is executed
when the exception assigned to them is thrown.  The actual code that
throws the exception can actually be far from the ~try~ block and the
~catch~ blocks, but nevertheless, to find the handler that needs to be
executed, the rules of dynamic scope are followed.

*** Anonymous Functions
Another important feature of Lisp and of Scheme, is support of
anonymous functions, also known as lambda functions.

What it means is that they are just functions, but without a name.
The way of calling them /lambda/ functions comes from lambda calculus,
which is system that abstracts functions.  The only object in lambda
calculus is a function and the only operation allowed is the function
application.  Functions have no names.

The way the functions are used in lambda calculus gives and example
how anonymous functions can be used in programming languages: by
passing them as parameters.

Indeed, if the language does not support first-class functions,
anonymous functions can seem to be a completely useless concept: what
is the use of creating something you have no way to refer to?

Anyway, the concept of lambda functions was born before the first
programming language was made, and it is also the reason why Lisp, the
first language to use anonymous functions, used the lambda keyword to
refer to them.

But even if they are not supported, it's still possible to get their
full functionality by just creating normal named functions and to pass
them.  Here lies another problem: the language has to support the
definition of local functions because lambda functions are typically
used in a local context, which can reference local variables (which
are, by the way, non-local to the lambda function).  So by simply
passing a top-level function will not provide the same functionality.

Another way anonymous functions are often used, is to return a
function as a function's return value.  This way it's possible to
write a function that acts as a function factory, which creates
different functions based on arguments passed to it.  This is
something not possible to do with just function pointers, because they
don't capture the environment.

So, here is a simple example of usage of an anonymous function in Scheme:
#+BEGIN_SRC scheme
(define (fn f c)
  (+ (f 5) c))

(fn (lambda (x) (* x 100)) 3)
#+END_SRC

#+RESULTS:
: 503

It the code creates an anonymous function that simply multiplies its
argument by 100.  The ~fn~ function calls it with value 5 and adds to
the second argument.  So the result is $503 = (100 * 5) + 3$.

